biddr_api/app/controllers/api/v1/items_controller.rb

    def index
        items = Item.order(created_at: :desc)
---
SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC

    def show
        item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]